Simsoniteee/TestRepo/F2837x_timer_pinInput/device/driverlib/pin_map.h
//###########################################################################
//
// FILE:   pin_map.h
//
// TITLE:  Definitions of pin mux info for gpio.c.
//
//###########################################################################
// $TI Release: F2837xD Support Library v3.01.00.00 $
// $Release Date: Mon May 22 15:43:40 CDT 2017 $
//###########################################################################

#ifndef __PIN_MAP_H__
#define __PIN_MAP_H__

//*****************************************************************************
// 0x00000003 = MUX register value
// 0x0000000C = GMUX register value
// 0x0000FF00 = Shift amount within mux registers
// 0xFFFF0000 = Offset of MUX register
//*****************************************************************************
#define GPIO_0_GPIO0          0x00060000U
#define GPIO_0_EPWM1A         0x00060001U
#define GPIO_0_SDAA           0x00060006U

#define GPIO_1_GPIO1          0x00060200U
#define GPIO_1_EPWM1B         0x00060201U
#define GPIO_1_MFSRB          0x00060203U
#define GPIO_1_SCLA           0x00060206U

#define GPIO_2_GPIO2          0x00060400U
#define GPIO_2_EPWM2A         0x00060401U
#define GPIO_2_OUTPUTXBAR1    0x00060405U
#define GPIO_2_SDAB           0x00060406U

#define GPIO_3_GPIO3          0x00060600U
#define GPIO_3_EPWM2B         0x00060601U
#define GPIO_3_OUTPUTXBAR2    0x00060602U
#define GPIO_3_MCLKRB         0x00060603U
#define GPIO_3_SCLB           0x00060606U

#define GPIO_4_GPIO4          0x00060800U
#define GPIO_4_EPWM3A         0x00060801U
#define GPIO_4_OUTPUTXBAR3    0x00060805U
#define GPIO_4_CANTXA         0x00060806U

#define GPIO_5_GPIO5          0x00060A00U
#define GPIO_5_EPWM3B         0x00060A01U
#define GPIO_5_MFSRA          0x00060A02U
#define GPIO_5_OUTPUTXBAR3    0x00060A03U
#define GPIO_5_CANRXA         0x00060A06U

#define GPIO_6_GPIO6          0x00060C00U
#define GPIO_6_EPWM4A         0x00060C01U
#define GPIO_6_OUTPUTXBAR4    0x00060C02U
#define GPIO_6_EPWMSYNCO      0x00060C03U
#define GPIO_6_EQEP3A         0x00060C05U
#define GPIO_6_CANTXB         0x00060C06U

#define GPIO_7_GPIO7          0x00060E00U
#define GPIO_7_EPWM4B         0x00060E01U
#define GPIO_7_MCLKRA         0x00060E02U
#define GPIO_7_OUTPUTXBAR5    0x00060E03U
#define GPIO_7_EQEP3B         0x00060E05U
#define GPIO_7_CANRXB         0x00060E06U

#define GPIO_8_GPIO8          0x00061000U
#define GPIO_8_EPWM5A         0x00061001U
#define GPIO_8_CANTXB         0x00061002U
#define GPIO_8_ADCSOCAO       0x00061003U
#define GPIO_8_EQEP3S         0x00061005U
#define GPIO_8_SCITXDA        0x00061006U

#define GPIO_9_GPIO9          0x00061200U
#define GPIO_9_EPWM5B         0x00061201U
#define GPIO_9_SCITXDB        0x00061202U
#define GPIO_9_OUTPUTXBAR6    0x00061203U
#define GPIO_9_EQEP3I         0x00061205U
#define GPIO_9_SCIRXDA        0x00061206U

#define GPIO_10_GPIO10         0x00061400U
#define GPIO_10_EPWM6A         0x00061401U
#define GPIO_10_CANRXB         0x00061402U
#define GPIO_10_ADCSOCBO       0x00061403U
#define GPIO_10_EQEP1A         0x00061405U
#define GPIO_10_SCITXDB        0x00061406U
#define GPIO_10_UPP_WAIT       0x0006140FU

#define GPIO_11_GPIO11         0x00061600U
#define GPIO_11_EPWM6B         0x00061601U
#define GPIO_11_SCIRXDB        0x00061602U
#define GPIO_11_OUTPUTXBAR7    0x00061603U
#define GPIO_11_EQEP1B         0x00061605U
#define GPIO_11_UPP_STRT       0x0006160FU

#define GPIO_12_GPIO12         0x00061800U
#define GPIO_12_EPWM7A         0x00061801U
#define GPIO_12_CANTXB         0x00061802U
#define GPIO_12_MDXB           0x00061803U
#define GPIO_12_EQEP1S         0x00061805U
#define GPIO_12_SCITXDC        0x00061806U
#define GPIO_12_UPP_ENA        0x0006180FU

#define GPIO_13_GPIO13         0x00061A00U
#define GPIO_13_EPWM7B         0x00061A01U
#define GPIO_13_CANRXB         0x00061A02U
#define GPIO_13_MDRB           0x00061A03U
#define GPIO_13_EQEP1I         0x00061A05U
#define GPIO_13_SCIRXDC        0x00061A06U
#define GPIO_13_UPP_D7         0x00061A0FU

#define GPIO_14_GPIO14         0x00061C00U
#define GPIO_14_EPWM8A         0x00061C01U
#define GPIO_14_SCITXDB        0x00061C02U
#define GPIO_14_MCLKXB         0x00061C03U
#define GPIO_14_OUTPUTXBAR3    0x00061C06U
#define GPIO_14_UPP_D6         0x00061C0FU

#define GPIO_15_GPIO15         0x00061E00U
#define GPIO_15_EPWM8B         0x00061E01U
#define GPIO_15_SCIRXDB        0x00061E02U
#define GPIO_15_MFSXB          0x00061E03U
#define GPIO_15_OUTPUTXBAR4    0x00061E06U
#define GPIO_15_UPP_D5         0x00061E0FU

#define GPIO_16_GPIO16         0x00080000U
#define GPIO_16_SPISIMOA       0x00080001U
#define GPIO_16_CANTXB         0x00080002U
#define GPIO_16_OUTPUTXBAR7    0x00080003U
#define GPIO_16_EPWM9A         0x00080005U
#define GPIO_16_SD_D1          0x00080007U
#define GPIO_16_UPP_D4         0x0008000FU

#define GPIO_17_GPIO17         0x00080200U
#define GPIO_17_SPISOMIA       0x00080201U
#define GPIO_17_CANRXB         0x00080202U
#define GPIO_17_OUTPUTXBAR8    0x00080203U
#define GPIO_17_EPWM9B         0x00080205U
#define GPIO_17_SD_C1          0x00080207U
#define GPIO_17_UPP_D3         0x0008020FU

#define GPIO_18_GPIO18         0x00080400U
#define GPIO_18_SPICLKA        0x00080401U
#define GPIO_18_SCITXDB        0x00080402U
#define GPIO_18_CANRXA         0x00080403U
#define GPIO_18_EPWM10A        0x00080405U
#define GPIO_18_SD_D2          0x00080407U
#define GPIO_18_UPP_D2         0x0008040FU

#define GPIO_19_GPIO19         0x00080600U
#define GPIO_19_SPISTEA        0x00080601U
#define GPIO_19_SCIRXDB        0x00080602U
#define GPIO_19_CANTXA         0x00080603U
#define GPIO_19_EPWM10B        0x00080605U
#define GPIO_19_SD_C2          0x00080607U
#define GPIO_19_UPP_D1         0x0008060FU

#define GPIO_20_GPIO20         0x00080800U
#define GPIO_20_EQEP1A         0x00080801U
#define GPIO_20_MDXA           0x00080802U
#define GPIO_20_CANTXB         0x00080803U
#define GPIO_20_EPWM11A        0x00080805U
#define GPIO_20_SD_D3          0x00080807U
#define GPIO_20_UPP_D0         0x0008080FU

#define GPIO_21_GPIO21         0x00080A00U
#define GPIO_21_EQEP1B         0x00080A01U
#define GPIO_21_MDRA           0x00080A02U
#define GPIO_21_CANRXB         0x00080A03U
#define GPIO_21_EPWM11B        0x00080A05U
#define GPIO_21_SD_C3          0x00080A07U
#define GPIO_21_UPP_CLK        0x00080A0FU

