Simsoniteee/TestRepo/F2837x_timer_pinInput/device/driverlib/pin_map.h
#define GPIO_92_GPIO92         0x00881800U
#define GPIO_92_EM1A19         0x00881802U
#define GPIO_92_EM1BA1         0x00881803U
#define GPIO_92_SCLA           0x00881806U

#define GPIO_93_GPIO93         0x00881A00U
#define GPIO_93_EM1A20         0x00881A02U
#define GPIO_93_EM1BA0         0x00881A03U
#define GPIO_93_SCITXDD        0x00881A06U

#define GPIO_94_GPIO94         0x00881C00U
#define GPIO_94_EM1A21         0x00881C02U
#define GPIO_94_SCIRXDD        0x00881C06U

#define GPIO_95_GPIO95         0x00881E00U

#define GPIO_96_GPIO96         0x00C60000U
#define GPIO_96_EM2DQM1        0x00C60003U
#define GPIO_96_EQEP1A         0x00C60005U

#define GPIO_97_GPIO97         0x00C60200U
#define GPIO_97_EM2DQM0        0x00C60203U
#define GPIO_97_EQEP1B         0x00C60205U

#define GPIO_98_GPIO98         0x00C60400U
#define GPIO_98_EM2A0          0x00C60403U
#define GPIO_98_EQEP1S         0x00C60405U

#define GPIO_99_GPIO99         0x00C60600U
#define GPIO_99_EM2A1          0x00C60603U
#define GPIO_99_EQEP1I         0x00C60605U

#define GPIO_100_GPIO100        0x00C60800U
#define GPIO_100_EM2A2          0x00C60803U
#define GPIO_100_EQEP2A         0x00C60805U
#define GPIO_100_SPISIMOC       0x00C60806U

#define GPIO_101_GPIO101        0x00C60A00U
#define GPIO_101_EM2A3          0x00C60A03U
#define GPIO_101_EQEP2B         0x00C60A05U
#define GPIO_101_SPISOMIC       0x00C60A06U

#define GPIO_102_GPIO102        0x00C60C00U
#define GPIO_102_EM2A4          0x00C60C03U
#define GPIO_102_EQEP2S         0x00C60C05U
#define GPIO_102_SPICLKC        0x00C60C06U

#define GPIO_103_GPIO103        0x00C60E00U
#define GPIO_103_EM2A5          0x00C60E03U
#define GPIO_103_EQEP2I         0x00C60E05U
#define GPIO_103_SPISTEC        0x00C60E06U

#define GPIO_104_GPIO104        0x00C61000U
#define GPIO_104_SDAA           0x00C61001U
#define GPIO_104_EM2A6          0x00C61003U
#define GPIO_104_EQEP3A         0x00C61005U
#define GPIO_104_SCITXDD        0x00C61006U

#define GPIO_105_GPIO105        0x00C61200U
#define GPIO_105_SCLA           0x00C61201U
#define GPIO_105_EM2A7          0x00C61203U
#define GPIO_105_EQEP3B         0x00C61205U
#define GPIO_105_SCIRXDD        0x00C61206U

#define GPIO_106_GPIO106        0x00C61400U
#define GPIO_106_EM2A8          0x00C61403U
#define GPIO_106_EQEP3S         0x00C61405U
#define GPIO_106_SCITXDC        0x00C61406U

#define GPIO_107_GPIO107        0x00C61600U
#define GPIO_107_EM2A9          0x00C61603U
#define GPIO_107_EQEP3I         0x00C61605U
#define GPIO_107_SCIRXDC        0x00C61606U

#define GPIO_108_GPIO108        0x00C61800U
#define GPIO_108_EM2A10         0x00C61803U

#define GPIO_109_GPIO109        0x00C61A00U
#define GPIO_109_EM2A11         0x00C61A03U

#define GPIO_110_GPIO110        0x00C61C00U
#define GPIO_110_EM2WAIT1       0x00C61C03U

#define GPIO_111_GPIO111        0x00C61E00U
#define GPIO_111_EM2BA0         0x00C61E03U

#define GPIO_112_GPIO112        0x00C80000U
#define GPIO_112_EM2BA1         0x00C80003U

#define GPIO_113_GPIO113        0x00C80200U
#define GPIO_113_EM2CAS         0x00C80203U

#define GPIO_114_GPIO114        0x00C80400U
#define GPIO_114_EM2RAS         0x00C80403U

#define GPIO_115_GPIO115        0x00C80600U
#define GPIO_115_EM2CS0         0x00C80603U

#define GPIO_116_GPIO116        0x00C80800U
#define GPIO_116_EM2CS2         0x00C80803U

#define GPIO_117_GPIO117        0x00C80A00U
#define GPIO_117_EM1SDCKE       0x00C80A03U

#define GPIO_118_GPIO118        0x00C80C00U
#define GPIO_118_EM2CLK         0x00C80C03U

#define GPIO_119_GPIO119        0x00C80E00U
#define GPIO_119_EM2RNW         0x00C80E03U

#define GPIO_120_GPIO120        0x00C81000U
#define GPIO_120_EM2WEN         0x00C81003U
#define GPIO_120_USB0PFLT       0x00C8100FU

#define GPIO_121_GPIO121        0x00C81200U
#define GPIO_121_EM2OEN         0x00C81203U
#define GPIO_121_USB0EPEN       0x00C8120FU

#define GPIO_122_GPIO122        0x00C81400U
#define GPIO_122_SPISIMOC       0x00C81406U
#define GPIO_122_SD1_D1         0x00C81407U
#define GPIO_122_ODISCHRGVBUS   0x00C8140FU

#define GPIO_123_GPIO123        0x00C81600U
#define GPIO_123_SPISOMIC       0x00C81606U
#define GPIO_123_SD1_C1         0x00C81607U
#define GPIO_123_OCHRGVBUS      0x00C8160FU

#define GPIO_124_GPIO124        0x00C81800U
#define GPIO_124_SPICLKC        0x00C81806U
#define GPIO_124_SD1_D2         0x00C81807U
#define GPIO_124_ODMPULLDN      0x00C8180FU

#define GPIO_125_GPIO125        0x00C81A00U
#define GPIO_125_SPISTEC        0x00C81A06U
#define GPIO_125_SD1_C2         0x00C81A07U
#define GPIO_125_ODPPULLDN      0x00C81A0FU

#define GPIO_126_GPIO126        0x00C81C00U
#define GPIO_126_SD1_D3         0x00C81C07U
#define GPIO_126_OLSD_2_N       0x00C81C0FU

#define GPIO_127_GPIO127        0x00C81E00U
#define GPIO_127_SD1_C3         0x00C81E07U
#define GPIO_127_OLSD_1_N       0x00C81E0FU

#define GPIO_128_GPIO128        0x01060000U
#define GPIO_128_SD1_D4         0x01060007U
#define GPIO_128_OIDPULLUP      0x0106000FU

#define GPIO_129_GPIO129        0x01060200U
#define GPIO_129_SD1_C4         0x01060207U
#define GPIO_129_OSPEED         0x0106020FU

#define GPIO_130_GPIO130        0x01060400U
#define GPIO_130_SD2_D1         0x01060407U
#define GPIO_130_OSUSPEND       0x0106040FU

#define GPIO_131_GPIO131        0x01060600U
#define GPIO_131_SD2_C1         0x01060607U
#define GPIO_131_OOE            0x0106060FU

#define GPIO_132_GPIO132        0x01060800U
#define GPIO_132_SD2_D2         0x01060807U
#define GPIO_132_ODMSE0         0x0106080FU

#define GPIO_133_GPIO133        0x01060A00U
#define GPIO_133_SD2_C2         0x01060A07U
#define GPIO_133_ODPDAT         0x01060A0FU

#define GPIO_134_GPIO134        0x01060C00U
#define GPIO_134_SD2_D3         0x01060C07U
#define GPIO_134_IVBUSVALID     0x01060C0FU

#define GPIO_135_GPIO135        0x01060E00U
#define GPIO_135_SCITXDA        0x01060E06U
#define GPIO_135_SD2_C3         0x01060E07U

#define GPIO_136_GPIO136        0x01061000U
#define GPIO_136_SCIRXDA        0x01061006U
#define GPIO_136_SD2_D4         0x01061007U

