Simsoniteee/TestRepo/F2837x_timer_pinInput/device/driverlib/pin_map.h
#define GPIO_137_GPIO137        0x01061200U
#define GPIO_137_SCITXDB        0x01061206U
#define GPIO_137_SD2_C4         0x01061207U

#define GPIO_138_GPIO138        0x01061400U
#define GPIO_138_SCIRXDB        0x01061406U

#define GPIO_139_GPIO139        0x01061600U
#define GPIO_139_SCIRXDC        0x01061606U

#define GPIO_140_GPIO140        0x01061800U
#define GPIO_140_SCITXDC        0x01061806U

#define GPIO_141_GPIO141        0x01061A00U
#define GPIO_141_SCIRXDD        0x01061A06U

#define GPIO_142_GPIO142        0x01061C00U
#define GPIO_142_SCITXDD        0x01061C06U

#define GPIO_143_GPIO143        0x01061E00U

#define GPIO_144_GPIO144        0x01080000U

#define GPIO_145_GPIO145        0x01080200U
#define GPIO_145_EPWM1A         0x01080201U

#define GPIO_146_GPIO146        0x01080400U
#define GPIO_146_EPWM1B         0x01080401U

#define GPIO_147_GPIO147        0x01080600U
#define GPIO_147_EPWM2A         0x01080601U

#define GPIO_148_GPIO148        0x01080800U
#define GPIO_148_EPWM2B         0x01080801U

#define GPIO_149_GPIO149        0x01080A00U
#define GPIO_149_EPWM3A         0x01080A01U

#define GPIO_150_GPIO150        0x01080C00U
#define GPIO_150_EPWM3B         0x01080C01U

#define GPIO_151_GPIO151        0x01080E00U
#define GPIO_151_EPWM4A         0x01080E01U

#define GPIO_152_GPIO152        0x01081000U
#define GPIO_152_EPWM4B         0x01081001U

#define GPIO_153_GPIO153        0x01081200U
#define GPIO_153_EPWM5A         0x01081201U

#define GPIO_154_GPIO154        0x01081400U
#define GPIO_154_EPWM5B         0x01081401U

#define GPIO_155_GPIO155        0x01081600U
#define GPIO_155_EPWM6A         0x01081601U

#define GPIO_156_GPIO156        0x01081800U
#define GPIO_156_EPWM6B         0x01081801U

#define GPIO_157_GPIO157        0x01081A00U
#define GPIO_157_EPWM7A         0x01081A01U

#define GPIO_158_GPIO158        0x01081C00U
#define GPIO_158_EPWM7B         0x01081C01U

#define GPIO_159_GPIO159        0x01081E00U
#define GPIO_159_EPWM8A         0x01081E01U

#define GPIO_160_GPIO160        0x01460000U
#define GPIO_160_EPWM8B         0x01460001U

#define GPIO_161_GPIO161        0x01460200U
#define GPIO_161_EPWM9A         0x01460201U

#define GPIO_162_GPIO162        0x01460400U
#define GPIO_162_EPWM9B         0x01460401U

#define GPIO_163_GPIO163        0x01460600U
#define GPIO_163_EPWM10A        0x01460601U

#define GPIO_164_GPIO164        0x01460800U
#define GPIO_164_EPWM10B        0x01460801U

#define GPIO_165_GPIO165        0x01460A00U
#define GPIO_165_EPWM11A        0x01460A01U

#define GPIO_166_GPIO166        0x01460C00U
#define GPIO_166_EPWM11B        0x01460C01U

#define GPIO_167_GPIO167        0x01460E00U
#define GPIO_167_EPWM12A        0x01460E01U

#define GPIO_168_GPIO168        0x01461000U
#define GPIO_168_EPWM12B        0x01461001U

#endif // __PIN_MAP_H__
